[
    {
        "id": 1,
        "title": "How I Created My Web Portfolio with Laravel, Breeze, Livewire, and TailwindCSS",
        "image": "images/misc/stack.png",
        "summary": "<p>Developing my web portfolio with <strong>Laravel</strong>, <strong>Breeze</strong>, <strong>Livewire</strong>, <strong>TailwindCSS</strong>, and <strong>Alpine.js</strong> was an exciting and rewarding process. Inspired by various sources and with the help of <strong>ChatGPT</strong>, I was able to create a unique and functional design. I implemented a <strong>GitHub Action</strong> for automatic deployment on my <strong>VPS</strong>, which optimized my workflow. Learning new tools is key for growth as a developer.</p>",
        "content": "<p>Developing my web portfolio was an exciting, challenging, and, above all, very satisfying process. I decided to use <strong>Laravel</strong> as the base, taking advantage of its starter kit <strong>Breeze</strong> to obtain a solid initial structure with basic authentication. Breeze was the perfect starting point to customize and adapt the project to my needs. I wanted the portfolio to not only showcase my projects but also reflect my ability to work with modern technologies like <strong>Livewire</strong>, <strong>TailwindCSS</strong>, and <strong>Alpine.js</strong>.</p><p>The most interesting part of the development was the <strong>design creation</strong>. Although I gathered some ideas from designers' websites and <strong>Pinterest</strong>, the final design was mostly the result of my personal creativity. TailwindCSS allowed me to work quickly and efficiently on the visual style of the site, maintaining a minimalist and clean appearance, which made the process smoother and gave me almost total control over the page's look. The use of <strong>TailwindCSS</strong> was undoubtedly one of the most gratifying aspects, as it allowed me to customize without overloading the code with unnecessary classes.</p><p><strong>Livewire</strong> played a crucial role in creating interactive components without the need to write excessive JavaScript. This enabled me to develop dynamic functionalities such as real-time forms or updates to the project list without reloading the page. On the other hand, <strong>Alpine.js</strong> helped me add light and efficient interactivity, enhancing the user experience without impacting site speed.</p><p>One of the aspects I enjoyed most during the process was the opportunity to learn and dive into new tools. I relied on <strong>ChatGPT</strong>, which became my main ally in solving implementation problems and optimizing the code. Having access to this tool allowed me to better understand the interaction between <strong>Laravel</strong>, <strong>Livewire</strong>, and <strong>Alpine.js</strong>, helping me master new technologies. This learning process was very satisfying, as it helped me improve my skills as a developer. In a world where technologies advance rapidly, understanding new tools and adapting quickly is essential for standing out.</p><p>Furthermore, I wanted to ensure that my portfolio was always efficiently updated, so I implemented a <strong>GitHub Action</strong> to automatically deploy the code to my personal server hosted on a <strong>VPS</strong>. This allows me to make changes and updates simply by pushing to my <strong>GitHub</strong> repository, saving time and reducing the margin of error in the deployment process. This level of automation is not only practical but also taught me a lot about the importance of optimizing workflows in web development.</p><p>In summary, the process of creating my portfolio has been an incredibly rewarding experience. Not only have I been able to combine creativity and functionality using <strong>Laravel</strong>, <strong>Livewire</strong>, <strong>TailwindCSS</strong>, and <strong>Alpine.js</strong>, but I have also learned a great deal about working with these modern tools. This knowledge is key to continuing to grow as a developer in an environment where technology is constantly changing. My complete code is available on <strong>GitHub</strong>, and I hope it can serve as inspiration or a guide for other developers looking to create an attractive and functional portfolio.</p>",
        "author": "Migbertweb",
        "date": "25 Sept 2024"
    },
    {
        "id": 3,
        "title": "Artificial Intelligence: Between Science and Science Fiction",
        "image": "images/misc/andrea-de-santis.jpg",
        "summary": "This article explores the evolution of artificial intelligence through the movies \"Terminator\" and \"Ghost in the Shell\", analyzing how these stories reflect our fears about the future of machines and automation. With a touch of dark humor, the implications of a possible robot dominance and the relationship with current technological advancement are discussed.",
        "content": "<p>Artificial Intelligence (AI) has ceased to be a mere fantasy from science fiction movies and has become a tangible reality that permeates every aspect of our lives. From virtual assistants like Siri or Alexa to autonomous cars that promise to avoid the typical Monday morning traffic jams (though they don’t promise to reduce the rudeness of some drivers), AI is advancing by leaps and bounds. But, like all technology, it comes with concerns, many of them fueled by the most iconic films in cinema.</p>\n<p>Today, we are going to tackle two titles that have shaped our perception of AI: Terminator and Ghost in the Shell. And yes, while we talk about killer robots and philosophical cyborgs, we can’t help but ask ourselves: How close are we to a future where AI rebels against us? Spoiler: closer than you think, but perhaps not in the way you imagine.</p>\n<p><strong>Terminator: The Cyber Apocalypse and Reality</strong></p>\n<p>\"I'll be back,\" said Arnold Schwarzenegger in Terminator. And what exactly was coming back? Well, in simple terms, an unstoppable killer with steel muscles and not an ounce of conscience, courtesy of Skynet, an AI that decided humanity was no longer necessary. And while the idea that an AI might decide that humans are the weakest link sounds terrifying, the truth is that today’s AIs aren’t so obsessed with extermination... yet.</p>\n<p>In the real world, AIs are more concerned with tasks like recommending what series to watch on Netflix or correcting our spelling mistakes. But of course, if you’ve ever wondered why you always end up seeing the same recommendations or why your spell checker changes “hello” to “holocaust” at the worst moment, maybe AI is already starting to send warning signals. Is it a simple error, or is Skynet trying to communicate?</p>\n<p>Although the apocalyptic scenario of Terminator seems distant, what is just around the corner is the increasing automation of processes that could make many jobs obsolete. And while robots aren’t yet patrolling the streets with machine guns, they are taking over factories and offices at an alarming rate. The fear is not that machines will take over the world (at least not for now), but that they might replace jobs that only humans could do before.</p>\n<p>The real dilemma is whether we will be able to integrate AI into our lives without destroying our own relevance. Although, if Terminator taught us anything, it’s that if machines ever rebel, we should at least have an Arnold Schwarzenegger in reserve.</p>\n<p><strong>Ghost in the Shell: Cyborgs and Existential Philosophy</strong></p>\n<p>On the other hand, Ghost in the Shell takes us to a future where the line between human and artificial is almost imperceptible. In this universe, people can enhance their bodies with cybernetic parts, and even transfer their consciousness into machines. The protagonist, Motoko Kusanagi, is a cyborg who constantly questions what it means to be human.</p>\n<p>These types of philosophical questions may seem distant when your biggest worry is whether your phone is spying on you or if Google’s AI knows more about you than your own mother (and, probably, it does). However, with the rapid development of AI and robotics, we are approaching a world where the fusion between the biological and the artificial will become a reality.</p>\n<p>The movie poses an intriguing question: What will happen when we start replacing parts of ourselves with technology? Imagine for a moment that, instead of those annoying dentist visits, you simply get a better jaw replacement. Or what if, instead of always forgetting where you left your keys, you could have a chip implanted that locates them in seconds?</p>\n<p>Of course, there’s also a dark side. If machines can host our consciousness, who will control those machines? Imagine that the next update to your internal operating system has bugs, or worse, that the AI controlling you decides you no longer need control over your own body. Or worse yet, that a future version of your cybernetic self prefers to watch soap operas all day instead of working.</p>\n<p>In Ghost in the Shell, the real fear is not that machines will destroy us physically, but that they will slowly erode what it means to be human. The idea of losing our individuality and becoming mere extensions of a global data network is perhaps more terrifying than any killer robot.</p>\n<p><strong>Between Reality and Fiction</strong></p>\n<p>Although we are still far from the more dramatic scenarios of Terminator or Ghost in the Shell, artificial intelligence poses ethical and existential challenges that we cannot ignore. It’s not so much about whether AI will rebel against us in a science fiction apocalypse, but about how it will affect our daily lives and our perception of what it means to be human.</p>\n<p>The question is not whether we will be dominated by a killer AI (although we can always give Schwarzenegger a nod just in case), but how we will adapt to a world where technology is becoming an integral part of our identity. Will we still be able to remain human in a world dominated by machines? Or, worse, will we have to learn to get along with an algorithm that might be more interested in our consumption habits than in our existence?</p>\n<p>In any case, if the future is going to include killer robots or existential cyborgs, I hope they at least have good taste in Netflix series.</p>",
        "author": "Migbertweb",
        "date": "10 Ago 2024"
    },
    {
        "id": 4,
        "title": "Dragons, Rings, and Superpowers: Geopolitics in the Geek World",
        "image": "images/misc/throno.jpg",
        "summary": "Parallels are explored between the epic sagas \"The Lord of the Rings\" and \"Game of Thrones\" with current geopolitical issues. The article examines how the rise of China as a world power reflects a new global dynamic, while the West faces its own decline, in a narrative that seems straight out of medieval fantasy.",
        "content": "<p>Epic fantasy has given us stories of power, betrayal, ambition, and wars, but if we look closely, many of the ills plaguing the realms of <em>The Lord of the Rings</em>, <em>Game of Thrones</em>, and <em>House of the Dragon</em> have deep echoes in today’s social and geopolitical conflicts. After all, dragons and rings of power are just metaphors for what’s really at stake on the global stage.</strong></p>\n<p>But if you thought it was just about swords, dragons, and an evil Dark Lord, it’s time to pause and see how these tales reflect the power movements that dominate today’s world, with a touch of dark humor (because, let’s be honest, the real world sometimes surpasses fiction in absurdity).</p>\n<p><strong>The Lord of the Rings and the Empire of Consumerism</strong></p>\n<p>Let’s start with <em>The Lord of the Rings</em>. In the trilogy, Sauron, the great antagonist, tries to dominate the world through the One Ring, which represents absolute power. Doesn’t that sound familiar? Think of how global capitalism has tried to corner resources and markets under the banner of \"free trade.\" Instead of a ring, we have the dollar and the control of the global financial system.</p>\n<p>The United States, in this context, could embody Númenor, the great ancient civilization that, in its arrogance and hunger for power, collapsed under its own weight. After all, how many conflicts has the United States led or backed in the last 100 years to maintain its global dominance? The uncomfortable answer: too many. With over 80 military interventions since World War II, it’s hard not to see parallels with Sauron’s expansionism and his efforts to control all of Middle-earth. In today’s narrative, instead of rings, it’s natural resources like oil and minerals that attract greed.</p>\n<p>However, in the distant East (or in this case, the Far East), rises a power that has forged its own path, without direct military intervention: China. In this modern saga, China is not a dark threat but more like Rivendell or even the Elves in Lothlórien. Observing from a distance while the Western powers entangle themselves in their own conflicts. Unlike the traditional powers struggling to impose themselves, China has opted for patience and diplomacy, expanding its economic influence without needing to shed blood in the process.</p>\n<p><strong>Game of Thrones: Warring Dynasties and the Myth of Power</strong></p>\n<p>Moving on to <em>Game of Thrones</em>, where noble families desperately fight to sit on the Iron Throne. Here it’s easy to draw a comparison with the global power struggle between the great powers. The United States, the old guard, could be likened to the Lannisters: controlling the riches (or at least they used to) and maintaining their position through a game of intrigue, alliances, and sometimes, brutality. However, as we saw in the series, arrogance and strategic errors often come at a price.</p>\n<p>Meanwhile, Daenerys Targaryen (initially representing change and a new form of leadership), with her desire to break the cycle of tyranny, could embody the struggle of emerging powers. However, history teaches us that even the noblest ideals can go astray, and Daenerys ends up going mad, destroying everything in her path. Here, we might reflect on how some revolutions and power shifts end up repeating the same mistakes of the past.</p>\n<p>But back to China. While the Lannisters and Targaryens fight for power (just as the United States and its allies try to maintain their influence), China has played its own \"Game of Thrones\" with a different approach. Instead of dragons and armies, it has used economic strategy, a kind of silent but effective chess. The Belt and Road Initiative is a clear example of how China is building its global influence through infrastructure and trade, not with violence but with agreements that could turn other countries into economic dependents. The big question is: what will the rest of the world do when the Chinese Dragon is fully awake?</p>\n<p><strong>House of the Dragon: The Future of Powers</strong></p>\n<p><em>House of the Dragon</em> is a perfect mirror of the fierce competition between the great powers. The rise and fall of the Targaryens remind us that no matter how powerful empires are, they are always on the brink of collapse, whether through internal conflicts or leadership mistakes. Here, the metaphor of dragons couldn’t be more fitting: weapons of mass destruction, advanced technology, and giant economies are the modern dragons that powers wield with care. However, as in the series, there’s always the risk of losing control.</p>\n<p>In the real world, the United States remains a dominant power, but its hegemony is faltering. Meanwhile, China, with its strategic approach and \"millennial patience,\" seems to be lurking, waiting for the right moment to sit on its own \"Iron Throne,\" this time with the renminbi as its sword of power.</p>\n<p><strong>The Future: Who Will Win the Game?</strong></p>\n<p>Just like in the epic sagas we love, the geopolitical future is uncertain. The United States, with its endless wars and conflicts, may be approaching its own \"winter.\" Meanwhile, China has shown that diplomacy and patience can be just as effective as swords and dragons.</p>\n<p>In conclusion, while the fantasy realms fight for power in <em>The Lord of the Rings</em>, <em>Game of Thrones</em>, and <em>House of the Dragon</em>, the real world follows its own cycle of ambitions and conflicts. And while some may wish they had the power of a ring or a dragon to solve problems, perhaps what we really need is less fire and blood, and more diplomacy and strategy. Because, as we know, in the \"game of thrones\" of geopolitics, if you don’t play well, you inevitably lose... or end up like the Night King: frozen and shattered by your own mistakes.</p>",
        "author": "Migbertweb",
        "date": "03 Sep 2024"
    },
    {
        "id": 2,
        "title": "Laravel: The Superhero of PHP Frameworks (With a Cape Included)",
        "image": "images/misc/Laravel-Programmer.jpg",
        "summary": "Laravel has revolutionized PHP web development, providing developers with elegant and practical tools. This article covers its evolution since its inception in 2011, through its consolidation as a complete ecosystem, and its future projection, including cloud integration. Laravel has become a true superhero for modern programmers.",
        "content": "<p>In the vast and sometimes terrifying world of web development, there is a hero who has helped thousands of developers find their way to peace of mind and clean code: Laravel. This PHP framework has gone from being just another option in the jungle of tools to becoming something like the Batman of web development: reliable, with impressive gadgets, and always saving the day when everything seems lost. But how has Laravel evolved to become the favorite of so many developers? And more importantly, where is it headed?</p>\n<p><strong>The Origins of Laravel: “Hello World” with Style</strong></p>\n<p>More than a decade ago, PHP was already the favorite language of web developers, but it also had a bad reputation for producing messy and unmaintainable code. Enter Taylor Otwell, the creator of Laravel, like the Tony Stark of the PHP world, ready to create something that could give developers a <strong>robust, elegant framework, and most importantly, save them headaches</strong>.</p>\n<p>Laravel was launched in 2011 and has consistently evolved since. At first, it focused on offering a simple alternative to heavier frameworks like Symfony, but soon became much more than that. With features like the <strong>routing system</strong>, <strong>Eloquent ORM</strong>, and the famous <strong>fluent syntax</strong>, Laravel quickly gained popularity. It was like having a tool that not only did the job but did it with style, as if your code were on a runway for developers.</p>\n<p>As if that weren't enough, Laravel came with <strong>Artisan</strong>, a command engine that simplified repetitive tasks. Artisan not only made life easier for you, but it also made you feel like you had an invisible assistant working alongside you. Like Alfred for Batman, but without the British accent.</p>\n<p><strong>Laravel Today: A Complete Ecosystem (And Some New Toys)</strong></p>\n<p>Laravel didn’t stop at just being a framework. Like superheroes who expand their abilities with each movie, Laravel has grown into a complete ecosystem. Nowadays, working with Laravel is like walking into a candy store for developers, with tools and services that make life much easier.</p>\n<p>For example, there’s <strong>Laravel Forge</strong>, which helps you deploy applications without needing to be a ninja in DevOps. Or <strong>Laravel Vapor</strong>, which allows you to take your application to the cloud without lifting a single server. And what about <strong>Laravel Horizon</strong> for managing queues? Essentially, Laravel has allowed you to do things that would otherwise require three years of study or the help of a wizard.</p>\n<p>And let’s not forget <strong>Laravel Livewire</strong>, which has revolutionized the development of user interfaces without needing to dive into the chaotic world of JavaScript (where everything can break with a misplaced semicolon). Livewire allows you to create dynamic and reactive components directly in Laravel, as if Taylor Otwell were whispering “everything is going to be okay” in your ear every time you have to manipulate the DOM.</p>\n<p><strong>The Future of Laravel: Next Stop, World Domination?</strong></p>\n<p>The future of Laravel looks bright. With a growing community, new features, and a clear vision of what modern web development should be, Laravel seems destined to remain the favorite superhero of PHP developers.</p>\n<p>Taylor Otwell and his team don’t seem interested in stopping innovation. Laravel is evolving towards greater <strong>integration with modern technologies</strong> like <strong>serverless</strong>, <strong>microservices</strong>, and of course, the cloud. Ease of use will continue to be the central focus, but with increasingly powerful tools, Laravel promises to stay at the forefront of web development.</p>\n<p>And if you’ve ever wondered if Laravel will completely dominate the world of development, you’re not alone. With its focus on simplicity, elegance, and productivity, the day may come when other frameworks are just a footnote in the history books of web development.</p>\n<p><strong>A Few Jokes for the Road</strong></p>\n<p></p>\n<ol type=\"1\">\n<li><p><strong>Why don’t Laravel developers need coffee?</strong> Because Artisan does all the hard work.</p></li>\n</ol>\n<p></p>\n<ol type=\"1\">\n<li><p><strong>How do you know a Laravel developer is in love?</strong> Because they always say their code is “elegant.”</p></li>\n</ol>\n<p></p>\n<ol type=\"1\">\n<li><p><strong>What does a Symfony developer do when they discover Laravel?</strong> They realize they’ve been writing a nuclear physics treatise when they only needed to make a website.</p></li>\n</ol>\n<p><strong>Recommended Links to Learn More About Laravel</strong></p>\n<p>If you want to learn more about Laravel and how it has helped developers over the years, check out these articles:</p>\n<p></p>\n<ul>\n<li><p>The History of Laravel and Its Evolution</p></li>\n</ul>\n<p></p>\n<ul>\n<li><p>Laravel vs Symfony: Who Wins the Battle?</p></li>\n</ul>\n<p></p>\n<ul>\n<li><p>Laravel Livewire: The Revolution of PHP Interfaces</p></li>\n</ul>\n<p>In summary, Laravel has gone from being just a simple PHP framework to becoming an entire ecosystem for modern web development. And best of all, it has made writing PHP code something you not only enjoy but love. So, next time you're in the middle of a complex application, remember: Laravel is there, like a true superhero, ready to save you from the clutches of messy code.</p>\n",
        "author": "Migbertweb",
        "date": "15 Sep 2024"
    }
]
